cc-ex-01/disk_benchmark/tests/local/fio_stats.txt
=========== Test time: Sat 17 Jun 2017 16:12:31 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:12:33 2017
   read: IOPS=39.1k, BW=153MiB/s (160MB/s)(249MiB/1627msec)
    slat (usec): min=0, max=612, avg= 4.33, stdev= 4.77
    clat (usec): min=1, max=697, avg= 6.95, stdev=10.75
     lat (usec): min=4, max=698, avg=11.28, stdev=10.77
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    5], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   11], 95.00th=[   13],
     | 99.00th=[   20], 99.50th=[   42], 99.90th=[  187], 99.95th=[  258],
     | 99.99th=[  346]
   bw (  KiB/s): min=152297, max=159600, per=0.10%, avg=156048.33, stdev=3655.59
  write: IOPS=39.6k, BW=155MiB/s (162MB/s)(251MiB/1627msec)
    slat (usec): min=0, max=463, avg= 4.32, stdev= 4.72
    clat (usec): min=1, max=3079, avg= 7.72, stdev=14.42
     lat (usec): min=4, max=3080, avg=12.04, stdev=14.41
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    3], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   13], 95.00th=[   15],
     | 99.00th=[   25], 99.50th=[   65], 99.90th=[   90], 99.95th=[  102],
     | 99.99th=[  193]
   bw (  KiB/s): min=154963, max=162432, per=0.10%, avg=158006.67, stdev=3921.51
    lat (usec) : 2=9.60%, 4=26.03%, 10=34.89%, 20=27.99%, 50=0.92%
    lat (usec) : 100=0.47%, 250=0.07%, 500=0.03%, 750=0.01%
    lat (msec) : 4=0.01%
  cpu          : usr=23.00%, sys=36.47%, ctx=154169, majf=2, minf=3
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=153MiB/s (160MB/s), 153MiB/s-153MiB/s (160MB/s-160MB/s), io=249MiB (261MB), run=1627-1627msec
  WRITE: bw=155MiB/s (162MB/s), 155MiB/s-155MiB/s (162MB/s-162MB/s), io=251MiB (264MB), run=1627-1627msec


=========== Test time: Sat 17 Jun 2017 16:18:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:18:26 2017
   read: IOPS=37.4k, BW=146MiB/s (153MB/s)(249MiB/1702msec)
    slat (usec): min=0, max=98, avg= 4.20, stdev= 3.94
    clat (usec): min=1, max=768, avg= 7.25, stdev=11.61
     lat (usec): min=4, max=772, avg=11.46, stdev=11.34
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   23], 99.50th=[   47], 99.90th=[  193], 99.95th=[  262],
     | 99.99th=[  418]
   bw (  KiB/s): min=143172, max=157992, per=0.10%, avg=149488.00, stdev=7648.44
  write: IOPS=37.8k, BW=148MiB/s (155MB/s)(251MiB/1702msec)
    slat (usec): min=0, max=91, avg= 4.23, stdev= 3.98
    clat (usec): min=1, max=1447, avg= 8.77, stdev=11.16
     lat (usec): min=4, max=1449, avg=13.00, stdev=10.86
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    5], 40.00th=[    7], 50.00th=[    8], 60.00th=[   10],
     | 70.00th=[   11], 80.00th=[   12], 90.00th=[   14], 95.00th=[   17],
     | 99.00th=[   34], 99.50th=[   66], 99.90th=[  103], 99.95th=[  114],
     | 99.99th=[  290]
   bw (  KiB/s): min=145415, max=158722, per=0.10%, avg=151210.67, stdev=6817.38
    lat (usec) : 2=7.87%, 4=25.09%, 10=31.98%, 20=32.82%, 50=1.62%
    lat (usec) : 100=0.49%, 250=0.09%, 500=0.03%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%
  cpu          : usr=22.75%, sys=35.51%, ctx=153300, majf=2, minf=3
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=146MiB/s (153MB/s), 146MiB/s-146MiB/s (153MB/s-153MB/s), io=249MiB (261MB), run=1702-1702msec
  WRITE: bw=148MiB/s (155MB/s), 148MiB/s-148MiB/s (155MB/s-155MB/s), io=251MiB (264MB), run=1702-1702msec


=========== Test time: Sat 17 Jun 2017 16:19:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:19:26 2017
   read: IOPS=37.3k, BW=146MiB/s (153MB/s)(249MiB/1705msec)
    slat (usec): min=0, max=1078, avg= 4.24, stdev= 6.63
    clat (usec): min=1, max=3665, avg= 7.32, stdev=19.89
     lat (usec): min=4, max=3666, avg=11.56, stdev=20.43
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   21], 99.50th=[   42], 99.90th=[  193], 99.95th=[  255],
     | 99.99th=[  410]
   bw (  KiB/s): min=142479, max=157172, per=0.10%, avg=148823.33, stdev=7548.78
  write: IOPS=37.8k, BW=147MiB/s (155MB/s)(251MiB/1705msec)
    slat (usec): min=0, max=365, avg= 4.21, stdev= 4.53
    clat (usec): min=1, max=690, avg= 8.71, stdev= 8.81
     lat (usec): min=5, max=692, avg=12.93, stdev= 8.71
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    6], 40.00th=[    7], 50.00th=[    8], 60.00th=[   10],
     | 70.00th=[   11], 80.00th=[   12], 90.00th=[   14], 95.00th=[   17],
     | 99.00th=[   31], 99.50th=[   64], 99.90th=[  100], 99.95th=[  113],
     | 99.99th=[  229]
   bw (  KiB/s): min=144768, max=157798, per=0.10%, avg=150542.33, stdev=6640.10
    lat (usec) : 2=7.44%, 4=24.56%, 10=32.59%, 20=33.52%, 50=1.32%
    lat (usec) : 100=0.44%, 250=0.09%, 500=0.03%, 750=0.01%, 1000=0.01%
    lat (msec) : 4=0.01%
  cpu          : usr=22.54%, sys=35.50%, ctx=153075, majf=2, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=146MiB/s (153MB/s), 146MiB/s-146MiB/s (153MB/s-153MB/s), io=249MiB (261MB), run=1705-1705msec
  WRITE: bw=147MiB/s (155MB/s), 147MiB/s-147MiB/s (155MB/s-155MB/s), io=251MiB (264MB), run=1705-1705msec


=========== Test time: Sat 17 Jun 2017 16:20:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:20:25 2017
   read: IOPS=40.1k, BW=157MiB/s (164MB/s)(249MiB/1585msec)
    slat (usec): min=0, max=264, avg= 4.21, stdev= 4.06
    clat (usec): min=1, max=689, avg= 6.89, stdev= 7.27
     lat (usec): min=5, max=690, avg=11.10, stdev= 6.86
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   13],
     | 99.00th=[   19], 99.50th=[   24], 99.90th=[   96], 99.95th=[  105],
     | 99.99th=[  135]
   bw (  KiB/s): min=158284, max=163903, per=0.10%, avg=161332.67, stdev=2839.88
  write: IOPS=40.6k, BW=159MiB/s (166MB/s)(251MiB/1585msec)
    slat (usec): min=0, max=63, avg= 4.27, stdev= 3.86
    clat (usec): min=1, max=611, avg= 7.29, stdev= 8.22
     lat (usec): min=5, max=612, avg=11.55, stdev= 7.77
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   21], 99.50th=[   65], 99.90th=[  101], 99.95th=[  111],
     | 99.99th=[  135]
   bw (  KiB/s): min=161322, max=164416, per=0.10%, avg=163107.00, stdev=1600.98
    lat (usec) : 2=8.40%, 4=28.03%, 10=33.10%, 20=29.36%, 50=0.69%
    lat (usec) : 100=0.32%, 250=0.09%, 500=0.01%, 750=0.01%
  cpu          : usr=23.86%, sys=37.37%, ctx=151665, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=157MiB/s (164MB/s), 157MiB/s-157MiB/s (164MB/s-164MB/s), io=249MiB (261MB), run=1585-1585msec
  WRITE: bw=159MiB/s (166MB/s), 159MiB/s-159MiB/s (166MB/s-166MB/s), io=251MiB (264MB), run=1585-1585msec


=========== Test time: Sat 17 Jun 2017 16:21:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:21:26 2017
   read: IOPS=39.7k, BW=155MiB/s (163MB/s)(249MiB/1602msec)
    slat (usec): min=0, max=235, avg= 4.30, stdev= 4.06
    clat (usec): min=1, max=589, avg= 6.86, stdev= 6.77
     lat (usec): min=5, max=591, avg=11.16, stdev= 6.31
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    5], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   20], 99.50th=[   25], 99.90th=[   88], 99.95th=[  101],
     | 99.99th=[  129]
   bw (  KiB/s): min=154904, max=163392, per=0.10%, avg=158809.33, stdev=4284.35
  write: IOPS=40.2k, BW=157MiB/s (165MB/s)(251MiB/1602msec)
    slat (usec): min=0, max=499, avg= 4.37, stdev= 4.44
    clat (usec): min=1, max=759, avg= 7.32, stdev= 9.28
     lat (usec): min=5, max=768, avg=11.69, stdev= 9.13
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   24], 99.50th=[   65], 99.90th=[   96], 99.95th=[  109],
     | 99.99th=[  338]
   bw (  KiB/s): min=158104, max=163952, per=0.10%, avg=160730.67, stdev=2969.01
    lat (usec) : 2=9.21%, 4=27.59%, 10=33.12%, 20=28.75%, 50=0.92%
    lat (usec) : 100=0.35%, 250=0.06%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=23.86%, sys=37.10%, ctx=152527, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=155MiB/s (163MB/s), 155MiB/s-155MiB/s (163MB/s-163MB/s), io=249MiB (261MB), run=1602-1602msec
  WRITE: bw=157MiB/s (165MB/s), 157MiB/s-157MiB/s (165MB/s-165MB/s), io=251MiB (264MB), run=1602-1602msec


=========== Test time: Sat 17 Jun 2017 16:22:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:22:25 2017
   read: IOPS=39.5k, BW=154MiB/s (162MB/s)(249MiB/1610msec)
    slat (usec): min=0, max=104, avg= 4.22, stdev= 3.90
    clat (usec): min=1, max=811, avg= 7.02, stdev= 8.18
     lat (usec): min=4, max=816, avg=11.24, stdev= 7.73
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    5], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   15],
     | 99.00th=[   22], 99.50th=[   30], 99.90th=[   92], 99.95th=[  108],
     | 99.99th=[  253]
   bw (  KiB/s): min=150997, max=165074, per=0.10%, avg=158544.33, stdev=7093.46
  write: IOPS=39.0k, BW=156MiB/s (164MB/s)(251MiB/1610msec)
    slat (usec): min=0, max=157, avg= 4.34, stdev= 4.04
    clat (usec): min=1, max=394, avg= 7.44, stdev= 8.67
     lat (usec): min=4, max=396, avg=11.78, stdev= 8.30
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   15],
     | 99.00th=[   26], 99.50th=[   68], 99.90th=[  106], 99.95th=[  119],
     | 99.99th=[  266]
   bw (  KiB/s): min=154533, max=165571, per=0.10%, avg=160474.67, stdev=5567.34
    lat (usec) : 2=9.81%, 4=26.95%, 10=32.17%, 20=29.36%, 50=1.25%
    lat (usec) : 100=0.35%, 250=0.09%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=23.49%, sys=36.86%, ctx=150351, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=154MiB/s (162MB/s), 154MiB/s-154MiB/s (162MB/s-162MB/s), io=249MiB (261MB), run=1610-1610msec
  WRITE: bw=156MiB/s (164MB/s), 156MiB/s-156MiB/s (164MB/s-164MB/s), io=251MiB (264MB), run=1610-1610msec


=========== Test time: Sat 17 Jun 2017 16:23:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:23:25 2017
   read: IOPS=38.7k, BW=151MiB/s (159MB/s)(249MiB/1644msec)
    slat (usec): min=0, max=358, avg= 4.32, stdev= 4.65
    clat (usec): min=1, max=1394, avg= 7.09, stdev=10.39
     lat (usec): min=4, max=1407, avg=11.42, stdev=10.38
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    5], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   15],
     | 99.00th=[   24], 99.50th=[   31], 99.90th=[  101], 99.95th=[  117],
     | 99.99th=[  418]
   bw (  KiB/s): min=143817, max=161208, per=0.10%, avg=154640.33, stdev=9444.30
  write: IOPS=39.2k, BW=153MiB/s (160MB/s)(251MiB/1644msec)
    slat (usec): min=0, max=414, avg= 4.40, stdev= 4.90
    clat (usec): min=1, max=3212, avg= 7.67, stdev=21.37
     lat (usec): min=4, max=3213, avg=12.06, stdev=21.42
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   13], 95.00th=[   16],
     | 99.00th=[   28], 99.50th=[   68], 99.90th=[  111], 99.95th=[  125],
     | 99.99th=[  422]
   bw (  KiB/s): min=146841, max=161784, per=0.10%, avg=156523.00, stdev=8395.37
    lat (usec) : 2=9.85%, 4=27.62%, 10=31.36%, 20=29.15%, 50=1.55%
    lat (usec) : 100=0.32%, 250=0.13%, 500=0.01%, 750=0.01%
    lat (msec) : 2=0.01%, 4=0.01%
  cpu          : usr=23.37%, sys=36.15%, ctx=149695, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=151MiB/s (159MB/s), 151MiB/s-151MiB/s (159MB/s-159MB/s), io=249MiB (261MB), run=1644-1644msec
  WRITE: bw=153MiB/s (160MB/s), 153MiB/s-153MiB/s (160MB/s-160MB/s), io=251MiB (264MB), run=1644-1644msec


=========== Test time: Sat 17 Jun 2017 16:24:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:24:26 2017
   read: IOPS=39.7k, BW=155MiB/s (162MB/s)(249MiB/1604msec)
    slat (usec): min=0, max=108, avg= 4.23, stdev= 3.88
    clat (usec): min=1, max=1545, avg= 6.89, stdev= 9.06
     lat (usec): min=4, max=1554, avg=11.11, stdev= 8.68
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    5], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   21], 99.50th=[   27], 99.90th=[   88], 99.95th=[  104],
     | 99.99th=[  143]
   bw (  KiB/s): min=152921, max=165896, per=0.10%, avg=159645.67, stdev=6500.49
  write: IOPS=40.1k, BW=157MiB/s (164MB/s)(251MiB/1604msec)
    slat (usec): min=0, max=314, avg= 4.31, stdev= 4.12
    clat (usec): min=1, max=4668, avg= 7.48, stdev=20.59
     lat (usec): min=4, max=4675, avg=11.79, stdev=20.46
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   15],
     | 99.00th=[   25], 99.50th=[   67], 99.90th=[  101], 99.95th=[  116],
     | 99.99th=[  207]
   bw (  KiB/s): min=156240, max=166344, per=0.10%, avg=161489.00, stdev=5063.51
    lat (usec) : 2=8.75%, 4=27.76%, 10=33.54%, 20=28.37%, 50=1.14%
    lat (usec) : 100=0.34%, 250=0.08%, 500=0.01%, 750=0.01%
    lat (msec) : 2=0.01%, 10=0.01%
  cpu          : usr=23.58%, sys=37.06%, ctx=151340, majf=0, minf=5
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=155MiB/s (162MB/s), 155MiB/s-155MiB/s (162MB/s-162MB/s), io=249MiB (261MB), run=1604-1604msec
  WRITE: bw=157MiB/s (164MB/s), 157MiB/s-157MiB/s (164MB/s-164MB/s), io=251MiB (264MB), run=1604-1604msec


=========== Test time: Sat 17 Jun 2017 16:25:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:25:25 2017
   read: IOPS=38.7k, BW=151MiB/s (158MB/s)(249MiB/1646msec)
    slat (usec): min=1, max=852, avg= 4.34, stdev= 5.43
    clat (usec): min=1, max=659, avg= 7.06, stdev= 6.87
     lat (usec): min=5, max=875, avg=11.40, stdev= 7.31
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   13],
     | 99.00th=[   20], 99.50th=[   24], 99.90th=[   88], 99.95th=[  102],
     | 99.99th=[  151]
   bw (  KiB/s): min=150976, max=158272, per=0.10%, avg=154301.33, stdev=3690.56
  write: IOPS=39.1k, BW=153MiB/s (160MB/s)(251MiB/1646msec)
    slat (usec): min=1, max=175, avg= 4.36, stdev= 4.09
    clat (usec): min=1, max=301, avg= 7.59, stdev= 7.56
     lat (usec): min=5, max=320, avg=11.95, stdev= 7.13
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    3], 40.00th=[    6], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   24], 99.50th=[   64], 99.90th=[   95], 99.95th=[  107],
     | 99.99th=[  151]
   bw (  KiB/s): min=153682, max=158976, per=0.10%, avg=156155.33, stdev=2664.04
    lat (usec) : 2=7.70%, 4=28.05%, 10=30.42%, 20=32.50%, 50=0.91%
    lat (usec) : 100=0.35%, 250=0.07%, 500=0.01%, 750=0.01%
  cpu          : usr=24.44%, sys=37.02%, ctx=151821, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=151MiB/s (158MB/s), 151MiB/s-151MiB/s (158MB/s-158MB/s), io=249MiB (261MB), run=1646-1646msec
  WRITE: bw=153MiB/s (160MB/s), 153MiB/s-153MiB/s (160MB/s-160MB/s), io=251MiB (264MB), run=1646-1646msec


=========== Test time: Sat 17 Jun 2017 16:26:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:26:26 2017
   read: IOPS=37.8k, BW=147MiB/s (155MB/s)(249MiB/1685msec)
    slat (usec): min=0, max=422, avg= 4.21, stdev= 4.67
    clat (usec): min=1, max=973, avg= 7.63, stdev=13.03
     lat (usec): min=4, max=989, avg=11.84, stdev=13.11
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   15],
     | 99.00th=[   26], 99.50th=[   53], 99.90th=[  213], 99.95th=[  278],
     | 99.99th=[  386]
   bw (  KiB/s): min=145608, max=155944, per=0.10%, avg=151477.33, stdev=5308.84
  write: IOPS=38.2k, BW=149MiB/s (156MB/s)(251MiB/1685msec)
    slat (usec): min=0, max=468, avg= 4.27, stdev= 5.00
    clat (usec): min=1, max=860, avg= 7.92, stdev=10.98
     lat (usec): min=5, max=862, avg=12.19, stdev=11.11
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    6], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   16],
     | 99.00th=[   33], 99.50th=[   72], 99.90th=[  114], 99.95th=[  141],
     | 99.99th=[  394]
   bw (  KiB/s): min=147912, max=158280, per=0.10%, avg=153205.33, stdev=5187.46
    lat (usec) : 2=8.45%, 4=26.90%, 10=30.83%, 20=31.78%, 50=1.36%
    lat (usec) : 100=0.46%, 250=0.18%, 500=0.04%, 750=0.01%, 1000=0.01%
  cpu          : usr=23.22%, sys=35.57%, ctx=147378, majf=2, minf=3
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=147MiB/s (155MB/s), 147MiB/s-147MiB/s (155MB/s-155MB/s), io=249MiB (261MB), run=1685-1685msec
  WRITE: bw=149MiB/s (156MB/s), 149MiB/s-149MiB/s (156MB/s-156MB/s), io=251MiB (264MB), run=1685-1685msec


=========== Test time: Sat 17 Jun 2017 16:27:24 CEST ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-2.20
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=3075: Sat Jun 17 16:27:26 2017
   read: IOPS=28.7k, BW=112MiB/s (117MB/s)(249MiB/2219msec)
    slat (usec): min=0, max=9372, avg= 5.57, stdev=56.47
    clat (usec): min=1, max=3094, avg= 9.45, stdev=20.31
     lat (usec): min=4, max=10153, avg=15.03, stdev=61.83
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    3], 40.00th=[    6], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   12], 90.00th=[   17], 95.00th=[   24],
     | 99.00th=[   45], 99.50th=[   65], 99.90th=[  183], 99.95th=[  322],
     | 99.99th=[  580]
   bw (  KiB/s): min=69214, max=146168, per=0.09%, avg=109346.25, stdev=32818.81
  write: IOPS=29.0k, BW=113MiB/s (119MB/s)(251MiB/2219msec)
    slat (usec): min=0, max=2776, avg= 5.45, stdev=22.60
    clat (usec): min=1, max=2355, avg=11.32, stdev=24.14
     lat (usec): min=4, max=2794, avg=16.77, stdev=33.09
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    6], 40.00th=[    8], 50.00th=[    9], 60.00th=[   10],
     | 70.00th=[   12], 80.00th=[   14], 90.00th=[   19], 95.00th=[   28],
     | 99.00th=[   62], 99.50th=[   93], 99.90th=[  354], 99.95th=[  506],
     | 99.99th=[  660]
   bw (  KiB/s): min=68476, max=148568, per=0.09%, avg=110509.25, stdev=33932.60
    lat (usec) : 2=7.29%, 4=22.68%, 10=26.55%, 20=34.72%, 50=7.64%
    lat (usec) : 100=0.78%, 250=0.25%, 500=0.06%, 750=0.03%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%
  cpu          : usr=21.19%, sys=32.01%, ctx=146902, majf=2, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=63625,64375,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=112MiB/s (117MB/s), 112MiB/s-112MiB/s (117MB/s-117MB/s), io=249MiB (261MB), run=2219-2219msec
  WRITE: bw=113MiB/s (119MB/s), 113MiB/s-113MiB/s (119MB/s-119MB/s), io=251MiB (264MB), run=2219-2219msec